//-----------------------------------------------------------------------------------------------  
/* websrv.local.tw/                 xaviorhsu.github.io/ */
  var HTTP_IP=(location.hostname=="websrv.local.tw")?'http://websrv.local.tw/hsusF/':'https://tncath.catholic.org.tw/';
  var nophp = 0; var flag=0;  
//-----------------------------------------------------------------------------------------------  
  /*var msg ="● 為了資料安全，已改成須以輸入帳密頁面方式才可看到族譜。\n";
      msg+="● 請23世、24世輩份的每一房，核對自己的資料，有否錯誤或不足，今後可透過填寫【與我聯絡】按鍵隨時提供正確資訊。";
      alert(msg);*/
//-----------------------------------------------------------------------------------------------